---
kind: enumMember
id: F:Autodesk.Revit.DB.Events.EventStatus.Failed
enum: Autodesk.Revit.DB.Events.EventStatus
source: html/b2db4f59-a798-a61b-9dd4-02dd6e9700f0.htm
---
# Autodesk.Revit.DB.Events.EventStatus.Failed

The action that triggered this event failed.